# Cohort Analysis

**Datacamp** : https://app.datacamp.com/learn/courses/customer-segmentation-in-python

## Imports & Load data

In [18]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

In [8]:
! ls

Cohort_Analysis.ipynb  data  EKI.ipynb	README.md

In [9]:
cohort_counts_df = pd.read_csv('data/cohort_counts.csv')
cohort_counts_df

,CohortMonth,1,2,3,4,5,6,7,8,9,10,11,12,13
0,2010-12-01,716.0,246.0,221.0,251.0,245.0,285.0,249.0,236.0,240.0,265.0,254.0,348.0,172.0
1,2011-01-01,332.0,69.0,82.0,81.0,110.0,90.0,82.0,86.0,104.0,102.0,124.0,45.0,NaN
2,2011-02-01,316.0,58.0,57.0,83.0,85.0,74.0,80.0,83.0,86.0,95.0,28.0,NaN,NaN
3,2011-03-01,388.0,63.0,100.0,76.0,83.0,67.0,98.0,85.0,107.0,38.0,NaN,NaN,NaN
4,2011-04-01,255.0,49.0,52.0,49.0,47.0,52.0,56.0,59.0,17.0,NaN,NaN,NaN,NaN
5,2011-05-01,249.0,40.0,43.0,36.0,52.0,58.0,61.0,22.0,NaN,NaN,NaN,NaN,NaN
6,2011-06-01,207.0,33.0,26.0,41.0,49.0,62.0,19.0,NaN,NaN,NaN,NaN,NaN,NaN
7,2011-07-01,173.0,28.0,31.0,38.0,44.0,17.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,2011-08-01,139.0,30.0,28.0,35.0,14.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,2011-09-01,279.0,56.0,78.0,34.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,2011-10-01,318.0,67.0,30.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,2011-11-01,291.0,32.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,2011-12-01,38.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
cohort_counts_df.set_index('CohortMonth', inplace=True)
cohort_counts_df

,1,2,3,4,5,6,7,8,9,10,11,12,13
CohortMonth,,,,,,,,,,,,,
2010-12-01,716.0,246.0,221.0,251.0,245.0,285.0,249.0,236.0,240.0,265.0,254.0,348.0,172.0
2011-01-01,332.0,69.0,82.0,81.0,110.0,90.0,82.0,86.0,104.0,102.0,124.0,45.0,NaN
2011-02-01,316.0,58.0,57.0,83.0,85.0,74.0,80.0,83.0,86.0,95.0,28.0,NaN,NaN
2011-03-01,388.0,63.0,100.0,76.0,83.0,67.0,98.0,85.0,107.0,38.0,NaN,NaN,NaN
2011-04-01,255.0,49.0,52.0,49.0,47.0,52.0,56.0,59.0,17.0,NaN,NaN,NaN,NaN
2011-05-01,249.0,40.0,43.0,36.0,52.0,58.0,61.0,22.0,NaN,NaN,NaN,NaN,NaN
2011-06-01,207.0,33.0,26.0,41.0,49.0,62.0,19.0,NaN,NaN,NaN,NaN,NaN,NaN
2011-07-01,173.0,28.0,31.0,38.0,44.0,17.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2011-08-01,139.0,30.0,28.0,35.0,14.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2011-09-01,279.0,56.0,78.0,34.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2011-10-01,318.0,67.0,30.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2011-11-01,291.0,32.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2011-12-01,38.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Cohort Month : month of first transaction

Num : cohort index

Metrics in the table

## Cohort analysis

Cohort analysis is a descriptive analytics tool. It groups the customers into mutually exclusive cohorts - which are then measured over time. Cohort analysis provides deeper insights than the so-called vanity metrics. It helps with understanding the high level trends better by providing insights on metrics across both the product and the customer lifecycle.

Type of cohorts : 
- Time cohorts are customers who signed up for a product or service during a particular time frame. Analyzing these cohorts 
shows the customers behavior depending on the time they started using the company s products or services. The time may be 
monthly or quarterly, even daily. 
- Behavior cohorts are customers who purchased a product or subscribed to a service in the past. It groups customers by the 
type of product or service they signed up. Customers who signed up for basic level services might have different needs than 
those who signed up for advanced services. Understanding the needs of the various cohorts can help a company design custom-made 
services or products for particular segments. 
- Size cohorts refer to the various sizes of customers who purchase company s products or services. This categorization can be 
based on the amount of spending in some period of time after acquisition, or the product type that the customer spent most of 
their order amount in some period of time. Now, let's look at the main elements of the cohort analysis.

In [5]:
#How many customers have made their first transaction in January 2011?
cohort_counts_df.loc['2011-01-01', '1']

332.0

In [15]:
cohort_counts_df.iloc[1][0]

332.0

### Time cohort

Now we will learn about the most popular cohort analysis type - time cohorts. We will segment customers into acquisition cohorts based on the month they made their first purchase. We will then assign the cohort index to each purchase of the customer. It will represent the number of months since the first transaction.

In [45]:
online_df = pd.read_csv('data/online.csv', index_col='Unnamed: 0')
online_df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
416792,572558,22745,POPPY'S PLAYHOUSE BEDROOM,6,2011-10-25 08:26:00,2.10,14286,United Kingdom
482904,577485,23196,VINTAGE LEAF MAGNETIC NOTEPAD,1,2011-11-20 11:56:00,1.45,16360,United Kingdom
263743,560034,23299,FOOD COVER WITH BEADS SET 2,6,2011-07-14 13:35:00,3.75,13933,United Kingdom
495549,578307,72349B,SET/6 PURPLE BUTTERFLY T-LIGHTS,1,2011-11-23 15:53:00,2.10,17290,United Kingdom
204384,554656,21756,BATH BUILDING BLOCK WORD,3,2011-05-25 13:36:00,5.95,17663,United Kingdom

In [46]:
online_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70864 entries, 416792 to 312243
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    70864 non-null  int64
 1   StockCode    70864 non-null  object
 2   Description  70864 non-null  object
 3   Quantity     70864 non-null  int64
 4   InvoiceDate  70864 non-null  object
 5   UnitPrice    70864 non-null  float64
 6   CustomerID   70864 non-null  int64
 7   Country      70864 non-null  object
dtypes: float64(1), int64(3), object(4)
memory usage: 4.9+ MB

In [47]:
online_df['InvoiceDate'] = pd.to_datetime(online_df['InvoiceDate'])
online_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70864 entries, 416792 to 312243
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    70864 non-null  int64
 1   StockCode    70864 non-null  object
 2   Description  70864 non-null  object
 3   Quantity     70864 non-null  int64
 4   InvoiceDate  70864 non-null  datetime64[ns]
 5   UnitPrice    70864 non-null  float64
 6   CustomerID   70864 non-null  int64
 7   Country      70864 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(3), object(3)
memory usage: 4.9+ MB

In [48]:
# Function that will parse the date
def get_day(x):
    return dt.datetime(x.year, x.month, x.day)

In [49]:
# Create a InvoiceDay column by passing the InvoiceDate columns and applying the get_day function
online_df['InvoiceDay'] = online_df['InvoiceDate'].apply(get_day)
online_df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,InvoiceDay
416792,572558,22745,POPPY'S PLAYHOUSE BEDROOM,6,2011-10-25 08:26:00,2.10,14286,United Kingdom,2011-10-25
482904,577485,23196,VINTAGE LEAF MAGNETIC NOTEPAD,1,2011-11-20 11:56:00,1.45,16360,United Kingdom,2011-11-20
263743,560034,23299,FOOD COVER WITH BEADS SET 2,6,2011-07-14 13:35:00,3.75,13933,United Kingdom,2011-07-14
495549,578307,72349B,SET/6 PURPLE BUTTERFLY T-LIGHTS,1,2011-11-23 15:53:00,2.10,17290,United Kingdom,2011-11-23
204384,554656,21756,BATH BUILDING BLOCK WORD,3,2011-05-25 13:36:00,5.95,17663,United Kingdom,2011-05-25

In [50]:
# Create a groupby object that groups CustomerID variable, and selects InvoiceDay for further calculations.
grouping = online_df.groupby('CustomerID')['InvoiceDay']

In [51]:
# Create a CohortDay column by selecting the minimum InvoiceDay value.
online_df['CohortDay'] = grouping.transform('min')
online_df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,InvoiceDay,CohortDay
416792,572558,22745,POPPY'S PLAYHOUSE BEDROOM,6,2011-10-25 08:26:00,2.10,14286,United Kingdom,2011-10-25,2011-04-11
482904,577485,23196,VINTAGE LEAF MAGNETIC NOTEPAD,1,2011-11-20 11:56:00,1.45,16360,United Kingdom,2011-11-20,2011-09-12
263743,560034,23299,FOOD COVER WITH BEADS SET 2,6,2011-07-14 13:35:00,3.75,13933,United Kingdom,2011-07-14,2011-07-14
495549,578307,72349B,SET/6 PURPLE BUTTERFLY T-LIGHTS,1,2011-11-23 15:53:00,2.10,17290,United Kingdom,2011-11-23,2011-11-23
204384,554656,21756,BATH BUILDING BLOCK WORD,3,2011-05-25 13:36:00,5.95,17663,United Kingdom,2011-05-25,2011-02-25

#### Calculate Time offset

Calculating time offset for each transaction allows you to report the metrics for each cohort in a comparable fashion.

In [52]:
# Get date function
def get_date_int(df, column):
    year = df[column].dt.year
    month = df[column].dt.month
    day = df[column].dt.day
    return year, month, day

In [53]:
# Create invoice_year, invoice_month, invoice_day objects by calling get_date_int function on InvoiceDay column.
invoice_year, invoice_month, invoice_day = get_date_int(online_df, 'InvoiceDay')

In [54]:
# Create cohort_year, cohort_month, cohort_day objects by calling get_date_int function on CohortDay column
cohort_year, cohort_month, cohort_day = get_date_int(online_df, 'CohortDay')

In [58]:
# Find the difference in years between the moment of the invoice and the moment the cohort was created
years_diff = invoice_year - cohort_year

# in month
months_diff = invoice_month - cohort_month

# in days
days_diff = invoice_day - cohort_day

In [60]:
# Calculate the number of days for the CohortIndex (assume 365 days in a year, and 30 days in a month)
online_df['CohortIndex'] = years_diff * 365 + months_diff * 30 + days_diff + 1
online_df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,InvoiceDay,CohortDay,CohortIndex
416792,572558,22745,POPPY'S PLAYHOUSE BEDROOM,6,2011-10-25 08:26:00,2.10,14286,United Kingdom,2011-10-25,2011-04-11,195
482904,577485,23196,VINTAGE LEAF MAGNETIC NOTEPAD,1,2011-11-20 11:56:00,1.45,16360,United Kingdom,2011-11-20,2011-09-12,69
263743,560034,23299,FOOD COVER WITH BEADS SET 2,6,2011-07-14 13:35:00,3.75,13933,United Kingdom,2011-07-14,2011-07-14,1
495549,578307,72349B,SET/6 PURPLE BUTTERFLY T-LIGHTS,1,2011-11-23 15:53:00,2.10,17290,United Kingdom,2011-11-23,2011-11-23,1
204384,554656,21756,BATH BUILDING BLOCK WORD,3,2011-05-25 13:36:00,5.95,17663,United Kingdom,2011-05-25,2011-02-25,91

In [62]:
online_df['CohortIndex'].unique()

array([195,  69,   1,  91, 271,  67, 103, 168,  73, 113,  48, 186, 295,
       324, 228, 140,  90, 193,  21, 314, 237, 141,  41,  79, 310, 157,
       240, 135, 155,  28,   8, 203, 144, 320, 371,  49,  50, 101,  58,
       352, 264, 319, 269,  75,  57, 349, 262,  53, 188,  62,  25, 360,
       197, 344, 115, 171, 177,  36, 318, 277,  42, 111,  30, 158, 116,
       366, 289, 303, 152, 313,  82, 233,  13, 250,  52, 221, 225, 270,
        60, 235,  70,  55, 351, 284,  84,  29, 341, 232, 259, 239, 301,
       273, 281, 121, 175,  89,  87,  85, 256, 355, 272,  34,  35, 133,
        51, 166, 196,  22, 199, 125, 297, 153,  27,  92,   6, 151, 105,
       241, 114, 194, 173, 204, 112, 364, 160, 230, 207, 214, 275, 170,
       321, 126, 354,  64, 229, 307, 300, 134, 292,  71, 106, 309,  19,
       142,  45, 198, 356,  15,  37,  47, 231,  40, 296, 124, 362, 249,
       224, 131, 294, 102, 163,  54,  12, 361, 308, 337, 201,  88,   7,
       147, 252, 139, 248, 257, 365, 267, 146, 219,  63, 176, 348, 261,
       100, 298, 137, 117, 304, 359, 331, 291, 243, 317, 107,  94, 210,
       174, 178, 122, 245, 127, 367, 130, 150, 104,  97, 282, 290, 159,
       251,  10,  46, 283, 215,   3, 132, 343, 179, 190, 154, 305,  44,
        26, 138,  14, 347, 180, 285, 191, 325, 293, 334,  38, 165,  23,
        99,   9, 255, 327,  20, 172, 118, 185, 258, 358, 340, 322, 148,
        76, 182, 336,  74, 266, 330, 316, 338, 357, 299,   2, 234, 346,
       169, 236,  33, 368,  61, 370, 222, 339, 200, 323,  83,   5, 208,
       265,  93, 345, 311,  96, 202,  18,  68, 213, 279,  81,  78, 287,
       260, 109, 212,  77, 136, 350, 254, 110, 238, 227, 372, 226, 129,
        56,  32, 247, 220, 164, 312, 205, 216,  66, 326,  24, 369, 120,
       123,  59, 288, 145, 119, 206, 353,  98,  39, 211, 333, 162,  80,
       156, 268, 183, 280,  11, 184,  65, 181, 217,  72, 187, 128, 223,
       242, 335,  43, 329, 263, 167, 244, 189, 209, 253, 342, 286, 149,
        86, 363, 373, 278, 332, 328, 192,  95, 143, 274,  16, 108,  31,
       315, 161,   4, 246,  17, 218, 302, 276, 306, 374])